/**

 *Submitted for verification at Etherscan.io on 2018-11-15

*/



pragma solidity ^0.4.25;



/**

 * §¬§à§ß§ä§â§Ñ§Ü§ä §¬§à§á§Ú§Ý§Ü§Ñ

 *

 * §£§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§ä §á§â§à§è§Ö§ß§ä§í §à§ä §Ó§Ñ§ê§Ú§ç §Õ§Ö§á§à§Ù§Ú§ä§à§Ó, §Ü§Ñ§Ø§Õ§í§Û §ã§Ý§Ö§Õ§å§ð§ë§Ú§Û §Ò§à§Ý§î§ê§Ö §á§â§Ö§Õ§í§Õ§å§ë§Ö§Ô§à

 * §Õ§à §Õ§à§ã§ä§Ú§Ø§Ö§ß§Ú§ñ §Ú§ä§à§Ô§à§Ó§à§Û §ã§å§Þ§Þ§Ñ§â§ß§à§Û §á§â§Ú§Ò§í§Ý§Ú §à§ä 53% §Õ§à 70%.

 *

 * §±§Ö§â§Ó§í§Û §Õ§Ö§á§à§Ù§Ú§ä §à§á§â§Ö§Õ§Ö§Ý§ñ§Ö§ä §Ó§Ñ§ê §Ö§Ø§Ö§Õ§ß§Ö§Ó§ß§í§Û §Ó§Ù§ß§à§ã

 * §¿§ä§à §à§á§â§Ö§Õ§Ö§Ý§ñ§Ö§ä, §ã§Ü§à§Ý§î§Ü§à §Ó§í §Þ§à§Ø§Ö§ä§Ö §Ó§ß§à§ã§Ú§ä§î §Ó §Ü§à§á§Ú§Ý§Ü§å §Ó §ã§â§Ö§Õ§ß§Ö§Þ §Ó §ä§Ö§é§Ö§ß§Ú§Ö §Õ§ß§ñ.

 *

 * §¬§à§á§Ú§Ý§Ü§Ñ §ß§Ñ §Ü§Ñ§Ø§Õ§í§Û §Õ§Ö§á§à§Ù§Ú§ä (§á§à§ã§Ý§Ö §á§Ö§â§Ó§à§Ô§à) §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§ä §á§à§ã§ä§à§ñ§ß§ß§à

 * §å§Ó§Ö§Ý§Ú§é§Ú§Ó§Ñ§ð§ë§Ú§Û§ã§ñ §á§â§à§è§Ö§ß§ä §à§ä §Ó§ß§Ö§ã§Ö§ß§ß§à§Ô§à §Õ§Ö§á§à§Ù§Ú§ä§Ñ

 *

 * §¬§à§Ô§Õ§Ñ §ã§å§Þ§Þ§Ñ§â§ß§à §Ó§ß§Ö§ã§Ö§ß§ß§Ñ§ñ §ã§å§Þ§Þ§Ñ §ã§ä§Ñ§ß§à§Ó§Ú§ä§ã§ñ §Ü§â§Ñ§ä§ß§Ñ §Õ§Ö§á§à§Ù§Ú§ä§å, §Ó§í §á§Ö§â§Ö§ç§à§Õ§Ú§ä§Ö §ß§Ñ

 * §ß§à§Ó§í§Û §å§â§à§Ó§Ö§ß§î. §³ §Ü§Ñ§Ø§Õ§í§Þ §å§â§à§Ó§ß§Ö§Þ §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§Þ§í§Ö §Ü§à§á§Ú§Ý§Ü§à§Û §á§â§à§è§Ö§ß§ä§í §å§Ó§Ö§Ý§Ú§é§Ú§Ó§Ñ§ð§ä§ã§ñ.

 * §µ§â§à§Ó§Ö§ß§î - §ï§ä§à §Ó§à §ã§Ü§à§Ý§î§Ü§à §â§Ñ§Ù §ã§å§Þ§Þ§Ñ §Ó§ß§Ö§ã§Ö§ß§ß§í§ç §Ó§Ñ§Þ§Ú §Ó§Ù§ß§à§ã§à§Ó §Ò§à§Ý§î§ê§Ö §á§Ö§â§Ó§à§Ô§à §Õ§Ö§á§à§Ù§Ú§ä§Ñ.

 *

 * §¯§Ñ§á§â§Ú§Þ§Ö§â, §Ó§í §Ó§ß§Ö§ã§Ý§Ú 1 ETH. §´§Ö§á§Ö§â§î §ï§ä§à §Ó§Ñ§ê §ã§â§Ö§Õ§ß§Ú§Û §Ö§Ø§Ö§Õ§ß§Ö§Ó§ß§í§Û §Ó§Ù§ß§à§ã. §ª §Ó§í

 * §ß§Ñ 1 §å§â§à§Ó§ß§Ö.

 *

 * §¹§Ö§â§Ö§Ù §Õ§Ö§ß§î §Ó§í §Ó§ß§Ö§ã§Ý§Ú 0.5 ETH. §°§Ò§ë§Ñ§ñ §ã§å§Þ§Þ§Ñ §Ó§Ü§Ý§Ñ§Õ§à§Ó 1.5 ETH, §Ó§í §Ó§ã§× §Ö§ë§×

 * §ß§Ñ §á§Ö§â§Ó§à§Þ §å§â§à§Ó§ß§Ö. §¬§à§á§Ú§Ý§Ü§Ñ §ã§â§Ñ§Ù§å §Ø§Ö §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§ä §Ó§Ñ§Þ §á§â§Ú§Þ§Ö§â§ß§à 0.24% §à§ä §Ó§Ü§Ý§Ñ§Õ§Ñ

 *

 * §¦§ë§Ö §é§Ö§â§Ö§Ù §Õ§Ö§ß§î §Ó§í §Ó§ß§Ö§ã§Ý§Ú §Ö§ë§Ö 1 ETH. 0.5 ETH §Ú§Ù §ß§Ú§ç §Ú§Õ§å§ä §ß§Ñ §á§Ö§â§Ó§í§Û §å§â§à§Ó§Ö§ß§î

 * §Õ§à §Õ§à§ã§ä§Ú§Ø§Ö§ß§Ú§ñ §Ó§Ñ§Þ§Ú §ã§å§Þ§Þ§Ñ§â§ß§à §Ó§ß§Ö§ã§Ö§ß§ß§à§Û §ã§å§Þ§Þ§Ö 2 ETH, §Ñ §Ö§ë§× 0.5 §å§Ø§Ö §ß§Ñ §Ó§ä§à§â§à§Þ

 * §Ó§Ñ§ê§Ö§Þ §å§â§à§Ó§ß§Ö. §¬§à§á§Ú§Ý§Ü§Ñ §ã§â§Ñ§Ù§å §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§ä §Ó§Ñ§Þ 0.24% §à§ä 0.5 ETH §Ú 0.96% §à§ä 0.5 §ß§Ñ

 * §Ó§ä§à§â§à§Þ §å§â§à§Ó§ß§Ö.

 *

 * §ª §ä§Ñ§Ü §Õ§Ñ§Ý§Ö§Ö. §±§â§Ú§Þ§Ö§â§ß§à §ß§Ñ 20§Þ §å§â§à§Ó§ß§Ö §Ü§à§á§Ú§Ý§Ü§Ñ §Ò§å§Õ§Ö§ä §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§ä§î §à§Ü§à§Ý§à 100%

 * §Ó§Ù§ß§à§ã§Ñ. §±§â§Ú§Þ§Ö§â§ß§à §ß§Ñ 35§Þ §å§â§à§Ó§ß§Ö §Ü§à§á§Ú§Ý§Ü§Ñ §Ò§å§Õ§Ö§ä §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§ä§î §à§Ü§à§Ý§à 300% §Ó§Ù§ß§à§ã§Ñ

 * §Ú §Ó §ã§å§Þ§Þ§Ö §Ó§í §á§à§Ý§å§é§Ú§ä§Ö §Ó§ã§×, §é§ä§à §Ó§ß§Ö§ã§Ý§Ú, §à§Ò§â§Ñ§ä§ß§à. §¥§Ñ§Ý§Ö§Ö §Õ§à 45 §å§â§à§Ó§ß§ñ §Ú§Õ§Ö§ä

 * §é§Ú§ã§ä§Ñ§ñ §á§â§Ú§Ò§í§Ý§î. §£§ß§à§ã§ñ §Ö§Ø§Ö§Õ§ß§Ö§Ó§ß§í§Û §Ó§Ù§ß§à§ã, §Ó§í §ã§â§Ñ§Ù§å §á§à§Ý§å§é§Ñ§Ö§ä§Ö §à§Ò§â§Ñ§ä§ß§à §à§ä 300%

 * §Õ§à 500% §à§ä §Ó§Ù§ß§à§ã§Ñ. §±§Ö§â§Ö§ç§à§Õ§Ñ §ß§Ñ 46§Û §å§â§à§Ó§Ö§ß§î §ß§Ö §á§â§à§Ú§ã§ç§à§Õ§Ú§ä, §Ó§í §å§Õ§Ñ§Ý§ñ§Ö§ä§Ö§ã§î

 * §Ú§Ù §Ü§à§á§Ú§Ý§Ü§Ú §Ú §Õ§Ý§ñ §á§â§à§Õ§à§Ý§Ø§Ö§ß§Ú§ñ §á§à§Ý§å§é§Ö§ß§Ú§ñ §á§â§Ú§Ò§í§Ý§Ú §Ó§Ñ§Þ §ß§å§Ø§ß§à §Õ§Ö§Ý§Ñ§ä§î §ß§à§Ó§í§Û §Ó§Ü§Ý§Ñ§Õ.

 *

 * §©§Ñ§Þ§Ö§é§Ñ§ß§Ú§ñ:

 *

 * §®§Ú§ß§Ú§Þ§Ñ§Ý§î§ß§í§Û §á§Ö§â§Ó§í§Û §Õ§Ö§á§à§Ù§Ú§ä 0.01 ETH, §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§í§Û - 5 ETH

 *

 * §±§à§Þ§ß§Ú§ä§Ö, §é§ä§à §â§Ñ§ã§ã§é§Ú§ä§Ñ§ä§î §á§Ö§â§Ó§í§Û §Õ§Ö§á§à§Ù§Ú§ä §ß§Ñ§Õ§à §ä§Ñ§Ü§Ú§Þ §à§Ò§â§Ñ§Ù§à§Þ, §é§ä§à§Ò§í §Ó§í §ã§Þ§à§Ô§Ý§Ú

 * §á§â§Ú§Þ§Ö§â§ß§à §Ö§Ø§Ö§Õ§ß§Ö§Ó§ß§à §Ó §ä§Ö§é§Ö§ß§Ú§Ö 20 §Õ§ß§Ö§Û §Ó§ß§à§ã§Ú§ä§î §Ö§Ô§à §Ó §Ü§à§á§Ú§Ý§Ü§å. §¥§Ñ§Ý§Ö§Ö §Ü§à§á§Ú§Ý§Ü§Ñ

 * §Ò§å§Õ§Ö§ä §Ó§à§Ù§Ó§â§Ñ§ë§Ñ§ä§î §Ó§Ñ§Þ §Ò§à§Ý§î§ê§Ö, §é§Ö§Þ §Ó§í §Ó§ß§à§ã§Ú§ä§Ö, §ä§Ñ§Ü §é§ä§à §á§â§à§Ò§Ý§Ö§Þ §ß§Ö §Ò§å§Õ§Ö§ä.

 *

 * §±§â§Ú §Ö§Ø§Ö§Õ§ß§Ö§Ó§ß§à§Þ §Ó§Ù§ß§à§ã§Ö 0.01 ETH §ã§å§Þ§Þ§Ñ§â§ß§Ñ§ñ §á§â§Ú§Ò§í§Ý§î 70%, 1 ETH - 67%,

 * 5 ETH - 53%, §á§â§Ú §á§â§à§Þ§Ö§Ø§å§ä§à§é§ß§í§ç §ã§å§Þ§Þ§Ñ§ç - §Ô§Õ§Ö-§ä§à §Þ§Ö§Ø§Õ§å §ß§Ú§Þ§Ú (§á§â§à§è§Ö§ß§ä §å§Ò§í§Ó§Ñ§Ö§ä

 * §ã §â§à§ã§ä§à§Þ §á§Ö§â§Ó§à§Ô§à §Õ§Ö§á§à§Ù§Ú§ä§Ñ).

 *

 * §£§í §Þ§à§Ø§Ö§ä§Ö §Ó§ß§à§ã§Ú§ä§î §Ö§Ø§Ö§Õ§ß§Ö§Ó§ß§í§Ö §Ó§Ù§ß§à§ã§í §Ó §Ý§ð§Ò§à§Ö §Ó§â§Ö§Þ§ñ, §Ý§ð§Ò§í§Þ§Ú §é§Ñ§ã§ä§ñ§Þ§Ú. §£§í §ß§Ö

 * §á§à§ä§Ö§â§ñ§Ö§ä§Ö §Ó§â§Ö§Þ§ñ, §Ö§ã§Ý§Ú §Ó §ã§â§Ö§Õ§ß§Ö§Þ §Ò§å§Õ§Ö§ä§Ö §Ó§ß§à§ã§Ú§ä§î §Ó §ß§Ö§Õ§Ö§Ý§ð §ã§å§Þ§Þ§å, §â§Ñ§Ó§ß§å§ð 7

 * §á§Ö§â§Ó§í§Þ §Õ§Ö§á§à§Ù§Ú§ä§Ñ§Þ. §¿§ä§à §Þ§à§Ø§ß§à §ã§Õ§Ö§Ý§Ñ§ä§î §Ú §Ó §á§à§ã§Ý§Ö§Õ§ß§Ú§Û §Õ§Ö§ß§î §ß§Ö§Õ§Ö§Ý§Ú. §¡ §Þ§à§Ø§ß§à

 * §é§Ñ§ã§ä§ñ§Þ§Ú §Ó §ä§Ö§é§Ö§ß§Ú§Ö §ß§Ö§Õ§Ö§Ý§Ú. §´§à§Ô§Õ§Ñ §Ó§í §Ò§å§Õ§Ö§ä§Ö §ß§Ñ§Ò§Ú§â§Ñ§ä§î 7 §å§â§à§Ó§ß§Ö§Û §Ó §ß§Ö§Õ§Ö§Ý§ð.

 *

 * §©§Ñ §à§Õ§Ú§ß §á§Ý§Ñ§ä§Ö§Ø §Ó§í §ã§Þ§à§Ø§Ö§ä§Ö §á§â§à§Õ§Ó§Ú§ß§å§ä§î§ã§ñ §Þ§Ñ§Ü§ã§Ú§Þ§å§Þ §ß§Ñ 7 §å§â§à§Ó§ß§Ö§Û. §±§à§ï§ä§à§Þ§å, §Ö§ã§Ý§Ú

 * §Õ§Ñ§Ø§Ö §á§à§ã§Ý§Ö§Õ§ß§Ú§Û §á§Ý§Ñ§ä§Ö§Ø §Ó§í §ã§Õ§Ö§Ý§Ñ§Ý§Ú §Ò§à§Ý§î§ê§Ö §ß§Ö§Õ§Ö§Ý§Ú §ß§Ñ§Ù§Ñ§Õ, §á§â§Ú §ã§à§Ó§Ö§â§ê§Ö§ß§Ú§Ú

 * §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§à§Ô§à §á§Ý§Ñ§ä§Ö§Ø§Ñ, §Ó§Ñ§Þ §Ú§Ù §ß§Ú§ç §Ò§å§Õ§Ö§ä §Ù§Ñ§ã§é§Ú§ä§Ñ§ß§Ñ §ä§à§Ý§î§Ü§à §ß§Ö§Õ§Ö§Ý§ñ.

 *

 * §¬§à§ß§ä§â§Ñ§Ü§ä §à§ä§ã§Ý§Ö§Ø§Ú§Ó§Ñ§Ö§ä, §ã§Ü§à§Ý§î§Ü§à §Ó§í §Þ§à§Ø§Ö§ä§Ö §Ó§ß§Ö§ã§ä§Ú §ß§Ñ §ä§Ö§Ü§å§ë§Ú§Û §Þ§à§Þ§Ö§ß§ä, §é§ä§à§Ò§í

 * §Ó§Ù§ß§à§ã§í §Ó §ã§â§Ö§Õ§ß§Ö§Þ §Ó §Õ§Ö§ß§î §ß§Ö §á§â§Ö§Ó§í§ê§Ñ§Ý§Ú §â§Ñ§Ù§Þ§Ö§â§Ñ §á§Ö§â§Ó§à§ß§Ñ§é§Ñ§Ý§î§ß§à§Ô§à §Õ§Ö§á§à§Ù§Ú§ä§Ñ. §¦§ã§Ý§Ú §Ó§í

 * §á§í§ä§Ñ§Ö§ä§Ö§ã§î §Ó§ß§Ö§ã§ä§Ú §Ò§à§Ý§î§ê§å§ð §ã§å§Þ§Þ§å, §Ü§à§ß§ä§â§Ñ§Ü§ä §á§â§Ú§Þ§Ö§ä §ä§à§Ý§î§Ü§à §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§à §â§Ñ§Ù§â§Ö§ê§Ö§ß§ß§å§ð

 * §Õ§Ý§ñ §Ó§Ñ§ã §ã§å§Þ§Þ§å §Ú §Ó§Ö§â§ß§Ö§ä §ã§Õ§Ñ§é§å. §±§à§ï§ä§à§Þ§å §Ó§í §Þ§à§Ø§Ö§ä§Ö §ß§Ö §Ò§Ö§ã§á§à§Ü§à§Ú§ä§î§ã§ñ §Ú §á§à§ã§í§Ý§Ñ§ä§î

 * §Ý§ð§Ò§í§Ö §ã§å§Þ§Þ§í.

 *

 * §£§à§Ù§Ó§â§Ñ§ä §Õ§Ö§á§à§Ù§Ú§ä§à§Ó.

 *

 * §¦§ã§Ý§Ú §Ó§í §ß§Ö§á§â§Ñ§Ó§Ú§Ý§î§ß§à §á§à§Õ§à§Ò§â§Ñ§Ý§Ú §â§Ñ§Ù§Þ§Ö§â §Ó§Ù§ß§à§ã§Ñ §Ú§Ý§Ú §á§â§à§ã§ä§à §ç§à§ä§Ú§ä§Ö §á§Ö§â§Ö§ã§ä§Ñ§ä§î §Ü§à§á§Ú§ä§î,

 * §ä§à §Ó§í §Þ§à§Ø§Ö§ä§Ö §Ù§Ñ§Ò§â§Ñ§ä§î §Õ§Ö§á§à§Ù§Ú§ä, §á§à§ã§Ý§Ñ§Ó 0.00000112 §ß§Ñ §Ñ§Õ§â§Ö§ã §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ.

 * §¢§å§Õ§Ö§ä §Ó§à§Ù§Ó§â§Ñ§ë§Ö§ß§à 70% §à§ä §Ó§ß§Ö§ã§Ö§ß§ß§í§ç §Ó§Ñ§Þ§Ú §ã§â§Ö§Õ§ã§ä§Ó + §å §Ó§Ñ§ã §à§ã§ä§Ñ§ß§Ö§ä§ã§ñ §Ó§ã§× §ä§à,

 * §é§ä§à §Ó§Ñ§Þ §å§Ø§Ö §Ó§í§á§Ý§Ñ§ä§Ú§Ý§Ñ §Ü§à§á§Ú§Ý§Ü§Ñ. §£§à§Ù§Ó§â§Ñ§ä §Õ§Ö§á§à§Ù§Ú§ä§Ñ §Ó§à§Ù§Þ§à§Ø§Ö§ß §Õ§à 10 §å§â§à§Ó§ß§ñ §Ó§Ü§Ý§ð§é§Ú§ä§Ö§Ý§î§ß§à.

 *

 *

 */



/** §´§Ñ§Ò§Ý§Ú§è§Ñ §Õ§Ö§á§à§Ù§Ú§ä§à§Ó §Ú §Ó§à§Ù§Ó§â§Ñ§ä§à§Ó §Õ§Ý§ñ §ß§Ñ§é§Ñ§Ý§î§ß§à§Ô§à §Õ§Ö§á§à§Ù§Ú§ä§Ñ 1 ETH



       §µ§â§à§Ó§Ö§ß§î/      §±§â§à§è§Ö§ß§ä§í        §³§å§Þ§Þ§Ñ§â§ß§í§Û

       C§å§Þ§Þ§Ñ (ETH)	  §£§à§Ù§Ó§â§Ñ§ä§Ñ        §Õ§à§ç§à§Õ (ETH)

           1			0,24%			0,00

           2			0,96%			0,01

           3			2,15%			0,03

           4			3,82%			0,07

           5			5,98%			0,13

           6			8,60%			0,22

           7			11,7%			0,33

           8			15,3%			0,49

           9			19,4%			0,68

           10			23,9%			0,92

           11			28,9%			1,21

           12			34,4%			1,55

           13			40,4%			1,96

           14			46,8%			2,43

           15			53,8%			2,96

           16			61,2%			3,58

           17			69,1%			4,27

           18			77,4%			5,04

           19			86,3%			5,90

           20			95,6%			6,86

           21			105%			7,91

           22			116%			9,07

           23			126%			10,33

           24			138%			11,71

           25			149%			13,20

           26			162%			14,82

           27			174%			16,56

           28			187%			18,44

           29			201%			20,45

           30			215%			22,60

           31			230%			24,89

           32			245%			27,34

           33			260%			29,94

           34			276%			32,71

           35			293%			35,63

           36			310%			38,73

           37			327%			42,00

           38			345%			45,46

           39			364%			49,09

           40			382%			52,91

           41			402%			56,93

           42			422%			61,15

           43			442%			65,57

           44			463%			70,19

           45			484%			75,03

*/



contract Kopilka {

    uint constant ADV_PERCENT = 2; //2%

    uint constant TEAM_PERCENT = 2; //2%

    uint constant MAX_LEVEL = 45; //§®§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§í§Û §å§â§à§Ó§Ö§ß§î, §Ü§à§ä§à§â§í§Û §Þ§à§Ø§ß§à §Õ§à§ã§ä§Ú§é§î

    uint constant PERIOD = 1 days; //§²§Ö§Ô§å§Ý§ñ§â§ß§à§ã§ä§î §Ó§ß§Ö§ã§Ö§ß§Ú§ñ §Ó§Ù§ß§à§ã§à§Ó

    uint constant MAX_ONE_TIME_PERIODS = 7; //§®§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§í§Û §â§Ñ§Ù§Þ§Ö§â §Ó§Ù§ß§à§ã§Ñ (§Ù§Ñ §ã§Ü§à§Ý§î§Ü§à §Õ§ß§Ö§Û)

    uint constant MIN_DEPOSIT = 0.01 ether; //§®§Ú§ß§Ú§Þ§Ñ§Ý§î§ß§í§Û §Õ§Ö§á§à§Ù§Ú§ä

    uint constant MAX_DEPOSIT = 5 ether;    //§®§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§í§Û §Õ§Ö§á§à§Ù§Ú§ä

    uint constant RETURN_DEPOSIT_PERCENT = 70; //70% - §á§â§à§è§Ö§ß§ä §Ó§à§Ù§Ó§â§Ñ§ä§Ñ §Õ§Ö§á§à§Ù§Ú§ä§Ñ

    uint constant MAX_LEVEL_TO_RETURN_DEPOSIT = 10; //§µ§â§à§Ó§Ö§ß§î, §Õ§à §Ü§à§ä§à§â§à§Ô§à §Þ§à§Ø§ß§à §Ó§Ö§â§ß§å§ä§î §Õ§Ö§á§à§Ù§Ú§ä



    //§³§ä§â§å§Ü§ä§å§â§Ñ §Õ§Ñ§ß§ß§í§ç §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ

    struct User {

        uint dep;   //§²§Ñ§Ù§Þ§Ö§â §Ö§Ø§Ö§Õ§ß§Ö§Ó§ß§à§Ô§à §Ó§Ù§ß§à§ã§Ñ

        uint value; //§³§å§Þ§Þ§Ñ §Ó§ã§Ö§ç §Ó§Ù§ß§à§ã§à§Ó

        uint atTime;//§¬§à§Ô§Õ§Ñ §Ò§í§Ý §ã§Õ§Ö§Ý§Ñ§ß §á§à§ã§Ý§Ö§Õ§ß§Ú§Û §Ó§Ù§ß§à§ã (§Ö§ã§Ý§Ú §Ò§í §à§ß§Ú §Õ§Ö§Ý§Ñ§Ý§Ú§ã§î §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§à §â§Ñ§Ó§ß§à§Þ§Ö§â§ß§à)

    }



    //§£§ã§Ö §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§Ú

    mapping (address => User) public users;



    //§¡§Õ§â§Ö§ã§Ñ §Ü§à§ê§Ö§Ý§î§Ü§à§Ó §Ñ§Õ§Þ§Ú§ß§Ú§ã§ä§â§Ñ§è§Ú§Ú

    address constant TEAM_ADDRESS = 0xF996A4e45E2f32F6BC5827A2448f7c2e54F69845;

    address constant ADV_ADDRESS = 0x18d84B54b6b1AEC9cdb2ef9B60E669FAD12Bb778;



    function () public payable {

        User storage user = users[msg.sender]; // §ï§ä§à §Ó§í



        if (msg.value != 0.00000112 ether) { //§¦§ã§Ý§Ú §Ó§ß§Ö§ã§Ý§Ú §Ó§Ù§ß§à§ã, §ä§à

            //§°§ä§é§Ú§ã§Ý§Ö§ß§Ú§ñ §Ñ§Õ§Þ§Ú§ß§Ú§ã§ä§â§Ñ§è§Ú§Ú §ß§Ñ §â§Ñ§Ù§Ó§Ú§ä§Ú§Ö §á§â§à§Ö§Ü§ä§Ñ

            ADV_ADDRESS.transfer(msg.value * ADV_PERCENT / 100);

            TEAM_ADDRESS.transfer(msg.value * TEAM_PERCENT / 100);



            if (user.value == 0) { //§¦§ã§Ý§Ú §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ §Ö§ë§× §ß§Ö §Ò§í§Ý§à

                //§´§à §ï§ä§à §á§Ö§â§Ó§í§Û §Ó§Ù§ß§à§ã. §¯§Ñ§Õ§à §Ö§Ô§à §á§â§à§Ó§Ö§â§Ú§ä§î §ß§Ñ §Ó§Ö§Ý§Ú§é§Ú§ß§å

                require(MIN_DEPOSIT <= msg.value && msg.value <= MAX_DEPOSIT);



                //§³§à§Ù§Õ§Ñ§×§Þ §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ

                user.dep = msg.value;

                user.value = msg.value;

                user.atTime = now;

            } else { //§¿§ä§à §á§à§Ó§ä§à§â§í§Û §Ó§Ù§ß§à§ã



                //§µ§Ù§ß§Ñ§×§Þ, §ã§Ü§à§Ý§î§Ü§à §Þ§à§Ø§ß§à §Ö§ë§× §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ð §Ó§ß§Ö§ã§ä§Ú

                //§Ú§ã§ç§à§Õ§ñ §Ú§Ù §ã§Ü§à§â§à§ã§ä§Ú §Ó§ß§Ö§ã§Ö§ß§Ú§ñ §á§Ö§â§Ó§í§Û §Ó§Ù§ß§à§ã/§Ó §Õ§Ö§ß§î.

                uint allowed = getAllowedInvestmentAmount(msg.sender);



                //§³§Ü§à§Ý§î§Ü§à §à§ß §á§â§Ú§ã§Ý§Ñ§Ý

                uint investment = msg.value;

                uint sendback = 0; //§³§Ü§à§Ý§î§Ü§à §Þ§í §Õ§à§Ý§Ø§ß§í §Ö§Þ§å §à§ä§á§â§Ñ§Ó§Ú§ä§î §à§Ò§â§Ñ§ä§ß§à



                //§¦§ã§Ý§Ú §à§ß §á§â§Ú§ã§Ý§Ñ§Ý §Ò§à§Ý§î§ê§Ö, §é§Ö§Þ §Ö§Þ§å §â§Ñ§Ù§â§Ö§ê§Ö§ß§à

                if(investment > allowed){

                    //§³§â§Ñ§Ù§å §Ù§Ñ§á§Ú§ã§í§Ó§Ñ§Ö§Þ §Ö§Þ§å §ã§Õ§Ñ§é§å

                    sendback = investment - allowed;

                    //§±§à§Ù§Ó§à§Ý§ñ§Ö§Þ §Ö§Þ§å §Ó§ß§Ö§ã§ä§Ú §ä§à§Ý§î§Ü§à §ã§Ü§à§Ý§î§Ü§à §â§Ñ§Ù§â§Ö§ê§Ö§ß§à

                    investment = allowed;

                }



                //§¬§à§â§â§Ö§Ü§ä§Ú§â§å§Ö§Þ §Ó§â§Ö§Þ§ñ §á§à§ã§Ý§Ö§Õ§ß§Ö§Ô§à §Ó§Ù§ß§à§ã§Ñ §ã §å§é§Ö§ä§à§Þ §ß§Ö§á§à§Ý§ß§à§Ô§à §Ó§Ù§ß§à§ã§Ñ

                //§¹§ä§à§Ò§í §Þ§à§Ø§ß§à §Ò§í§Ý§à §Õ§à§Ó§ß§Ö§ã§ä§Ú §á§à§Ù§Ø§Ö

                user.atTime = now - (allowed - investment)*PERIOD/user.dep;



                uint dep = user.dep;  //§²§Ñ§Ù§Þ§Ö§â §á§Ö§â§Ó§à§Ô§à §Ó§Ù§ß§à§ã§Ñ

                uint amount = user.value; //§³§Ü§à§Ý§î§Ü§à §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§î §å§Ø§Ö §Ó§ã§Ö§Ô§à §Ó§ß§Ö§ã

                uint level = amount/dep; //§¯§Ñ §Ü§Ñ§Ü§à§Þ §å§â§à§Ó§ß§Ö §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§î

                uint endLevel = (amount+investment)/dep; //§¯§Ñ §Ü§Ñ§Ü§à§Þ §å§â§à§Ó§ß§Ö §à§ß §à§Ü§Ñ§Ø§Ö§ä§ã§ñ §á§à§ã§Ý§Ö §ï§ä§à§Ô§à §Ó§Ù§ß§à§ã§Ñ



                //§±§à §Ó§ã§Ö§Þ §ß§à§Ó§í§Þ §å§â§à§Ó§ß§ñ§Þ §ß§Ñ§Õ§à §ã§Õ§Ö§Ý§Ñ§ä§î §Ö§Þ§å §Ó§í§á§Ý§Ñ§ä§í

                for(uint l=level; l<=endLevel; ++l){

                    //§°§á§â§Ö§Õ§Ö§Ý§ñ§Ö§Þ §â§Ñ§Ù§Þ§Ö§â §Ó§Ù§ß§à§ã§Ñ §ß§Ñ §Õ§Ñ§ß§ß§à§Þ §å§â§à§Ó§ß§Ö

                    uint levelInvestment = dep*(l+1) - amount;

                    //§¦§ã§Ý§Ú §Þ§Ñ§Ü§ã §â§Ñ§Ù§Þ§Ö§â §Ó§Ù§ß§à§ã§Ñ §ß§Ñ §ï§ä§à§Þ §å§â§à§Ó§ß§Ö §á§â§Ö§Ó§í§ê§Ñ§Ö§ä §æ§Ñ§Ü§ä§Ú§é§Ö§ã§Ü§Ú§Û §Ó§Ù§ß§à§ã

                    //§ä§à §é§Ñ§ã§ä§Ú§é§ß§à §à§á§Ý§Ñ§é§Ú§Ó§Ñ§Ö§Þ §Õ§Ñ§ß§ß§í§Û §å§â§à§Ó§Ö§ß§î

                    if(levelInvestment > investment) levelInvestment = investment;



                    //§¥§à§Ò§Ñ§Ó§Ý§ñ§Ö§Þ §Ó§í§á§Ý§Ñ§ä§å §ß§Ñ §ä§Ö§Ü§å§ë§Ö§Þ §å§â§à§Ó§ß§Ö

                    sendback += calcReturn(levelInvestment, l);

                    //§¥§à§Ò§Ñ§Ó§Ý§ñ§Ö§Þ §ï§ä§å §Ó§í§á§Ý§Ñ§ä§å §Ü §ã§å§Þ§Þ§Ö §Ó§ã§Ö§ç §Ó§Ù§ß§à§ã§à§Ó §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ

                    amount += levelInvestment;

                    //§£§í§é§Ú§ä§Ñ§Ö§Þ §å§Ø§Ö §Ù§Ñ§ã§é§Ú§ä§Ñ§ß§ß§í§Û §Ó§Ù§ß§à§ã §Ú§Ù §á§â§Ú§ã§Ý§Ñ§ß§ß§à§Ô§à §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§Ö§Þ §Ó§Ù§ß§à§ã§Ñ

                    investment -= levelInvestment;

                }



                //§°§Ò§ß§à§Ó§Ý§ñ§Ö§Þ §ã§å§Þ§Þ§å §Ó§Ù§ß§à§ã§à§Ó §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ

                user.value = amount;



                //§¦§ã§Ý§Ú §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§î §á§Ö§â§Ö§ê§Ö§Ý §ß§Ñ §ã§Ý§Ú§ê§Ü§à§Þ §Ó§í§ã§à§Ü§Ú§Û §å§â§à§Ó§Ö§ß§î

                //§µ§Õ§Ñ§Ý§ñ§Ö§Þ §Ö§Ô§à §Ú§Ù §Ü§à§á§Ú§Ý§Ü§Ú

                if(endLevel > MAX_LEVEL)

                    delete users[msg.sender];



                //§°§ä§á§â§Ñ§Ó§Ý§ñ§Ö§Þ §ã§Õ§Ñ§é§å §Ú §á§â§à§è§Ö§ß§ä§í §Ù§Ñ §Ó§Ù§ß§à§ã §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ð

                msg.sender.transfer(sendback);

            }

        } else if(user.dep > 0){ //§¦§ã§Ý§Ú §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§î §Ó§à§à§Ò§ë§Ö §é§ä§à-§ä§à §Ó§ß§à§ã§Ú§Ý

            //§±§â§à§Ó§Ö§â§ñ§Ö§Þ, §é§ä§à §å §ß§Ö§Ô§à §ß§Ö §ã§Ý§Ú§ê§Ü§à§Þ §Ò§à§Ý§î§ê§à§Û §å§â§à§Ó§Ö§ß§î §Õ§Ý§ñ §Ó§à§Ù§Ó§â§Ñ§ä§Ñ §Ó§Ù§ß§à§ã§à§Ó

            require(user.value/user.dep <= MAX_LEVEL_TO_RETURN_DEPOSIT, "It's too late to request a refund at this point");



            //§£§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§Þ 70% §à§ä §Ó§ã§Ö§Ô§à §Ú§Þ §Ó§ß§Ö§ã§Ö§ß§ß§à§Ô§à. §±§â§à§è§Ö§ß§ä§í, §å§Ø§Ö §Ó§í§á§Ý§Ñ§é§Ö§ß§ß§í§Ö §Ö§Þ§å, §å §ß§Ö§Ô§à §à§ã§ä§Ñ§ð§ä§ã§ñ.

            msg.sender.transfer(user.value * RETURN_DEPOSIT_PERCENT / 100);



            //§µ§Õ§Ñ§Ý§ñ§Ö§Þ §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ §Ú§Ù §Ü§à§á§Ú§Ý§Ü§Ú.

            delete users[msg.sender];

        }



    }



    //§±§à§Ý§å§é§Ñ§Ö§ä §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§à §Ó§à§Ù§Þ§à§Ø§ß§í§Û §Ó§Ù§ß§à§ã §à§ä §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ §ß§Ñ §ä§Ö§Ü§å§ë§Ú§Û §Þ§à§Þ§Ö§ß§ä

    //§ª§Ù §â§Ñ§ã§é§Ö§ä§Ñ, §é§ä§à§Ò§í §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§î §Ó§ß§à§ã§Ú§Ý §Ó §ã§â§Ö§Õ§ß§Ö§Þ §â§Ñ§Ù§Þ§Ö§â §á§Ö§â§Ó§à§Ô§à §Õ§Ö§á§à§Ù§Ú§ä§Ñ §Ó §Õ§Ö§ß§î.

    function getAllowedInvestmentAmount(address addr) public view returns (uint) {

        User storage user = users[addr]; // §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§î

        //§³§Ü§à§Ý§î§Ü§à §ß§Ñ§Õ§à §Ò§í§Ý§à §Ò§í §Ó§ß§Ö§ã§ä§Ú, §Ö§ã§Ý§Ú §Õ§Ö§Ý§Ñ§ä§î §ï§ä§à §Ñ§Ü§Ü§å§â§Ñ§ä§ß§à

        uint allowed = user.dep * (now - user.atTime) / PERIOD;

        //§¦§ã§Ý§Ú §Ó§ß§Ö§ã§ä§Ú §ß§Ñ§Õ§à §Ò§à§Ý§î§ê§Ö, §é§Ö§Þ §Ù§Ñ §ß§Ö§Õ§Ö§Ý§ð, §å§Þ§Ö§ß§î§ê§Ñ§Ö§Þ §Õ§à §Ó§Ù§ß§à§ã§Ñ §Ù§Ñ §ß§Ö§Õ§Ö§Ý§ð

        if(allowed > MAX_ONE_TIME_PERIODS*user.dep)

            allowed = MAX_ONE_TIME_PERIODS*user.dep;

        //§±§â§à§Ó§Ö§â§Ú§Þ, §é§ä§à §ï§ä§à§ä §Ó§Ù§ß§à§ã §ß§Ö §á§â§Ö§Ó§í§ã§Ú§ä §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§å§ð §ã§å§Þ§Þ§å §Ó§Ù§ß§à§ã§à§Ó

        uint max_investment = user.dep*MAX_LEVEL;

        //§¦§ã§Ý§Ú §Ó§Ù§ß§à§ã §á§â§Ö§Ó§í§ã§Ú§ä §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§å§ð §ã§å§Þ§Þ§å §Ó§Ù§ß§à§ã§à§Ó §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ

        //§´§à §å§Þ§Ö§ß§î§ê§Ñ§Ö§Þ §Ó§Ù§ß§à§ã §Õ§à §Ò§Ö§Ù§à§á§Ñ§ã§ß§à§Û §Ó§Ö§Ý§Ú§é§Ú§ß§í

        if(user.value + allowed > max_investment)

            allowed = max_investment > user.value ? max_investment - user.value : 0;

        //§£§à§Ù§Ó§â§Ñ§ë§Ñ§Ö§Þ §â§Ñ§Ù§Þ§Ö§â §ä§Ö§Ü§å§ë§Ö§Ô§à §Þ§Ñ§Ü§ã §Ó§Ù§ß§à§ã§Ñ

        return allowed;

    }



    //§±§à§Ý§å§é§Ñ§Ö§ä §Ó§à§Ù§Ó§â§Ñ§ä §á§â§à§è§Ö§ß§ä§Ñ §à§ä §Ù§Ñ§Õ§Ñ§ß§ß§à§Ô§à §Ó§Ù§ß§à§ã§Ñ §ß§Ñ §Ù§Ñ§Õ§Ñ§ß§ß§à§Þ §å§â§à§Ó§ß§Ö

    function calcReturn(uint investment, uint level) public pure returns (uint){

        //§¦§ã§Ý§Ú §å§â§à§Ó§Ö§â§î §Ò§à§Ý§î§ê§Ö §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§à§Ô§à, §ä§à §ß§Ú§é§Ö§Ô§à §ß§Ö §Ó§à§Ù§Ó§â§Ñ§ë§Ö§Þ

        if(level > MAX_LEVEL)

            level = 0;

        require(investment <= MAX_DEPOSIT);

        //§·§Ú§ä§â§Ñ§ñ §Ü§Ó§Ñ§Õ§â§Ñ§ä§Ú§é§ß§Ñ§ñ §æ§à§â§Þ§å§Ý§Ñ, §Ü§à§ä§à§â§Ñ§ñ §á§à§Ù§Ó§à§Ý§ñ§Ö§ä §Ó§ß§Ñ§é§Ñ§Ý§Ö §á§â§à§è§Ö§ß§ä§í §Õ§Ñ§Ó§Ñ§ä§î §Þ§Ñ§Ý§Ö§ß§î§Ü§Ú§Ö,

        //§Ñ §á§à§ä§à§Þ §Ò§à§Ý§î§ê§Ú§Ö, §á§à§Õ§à§Ò§â§Ñ§ß§Ñ §Õ§Ý§ñ §à§á§ä§Ú§Þ§Ñ§Ý§î§ß§à§Û §â§Ñ§Ò§à§ä§í §Ü§à§ß§ä§â§Ñ§Ü§ä§Ñ §Ú §ç§à§â§à§ê§Ö§Û §á§â§Ú§Ò§í§Ý§Ú

        //§á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§Ö§Û. §´§Ñ§Ò§Ý§Ú§è§Ñ §Ù§ß§Ñ§é§Ö§ß§Ú§Û §Õ§Ý§ñ §á§â§Ú§Þ§Ö§â§Ñ §Ó §Ü§à§Þ§Þ§Ö§ß§ä§Ñ§â§Ú§ñ§ç §Ó §ê§Ñ§á§Ü§Ö.

        return investment * level * level * (24400 - 500 * investment / 1 ether) / 10000000;

    }



    //§±§à§Ý§å§é§Ñ§Ö§ä §á§â§à§è§Ö§ß§ä, §Ü§à§ä§à§â§í§Û §Ò§å§Õ§Ö§ä §Ó§í§á§Ý§Ñ§é§Ú§Ó§Ñ§ä§î§ã§ñ §á§â§Ú §Ù§Ñ§Õ§Ñ§ß§ß§à§Þ §á§Ö§â§Ó§à§Þ §Ó§Ù§ß§à§ã§Ö §ß§Ñ §Ù§Ñ§Õ§Ñ§ß§ß§à§Þ §å§â§à§Ó§ß§Ö

    function calcReturnPercent(uint dep, uint level) public pure returns(uint) {

        return calcReturn(dep, level)*1000000/dep;

    }



    //§±§à§Ý§å§é§Ñ§Ö§ä §Ó§ã§Ö §á§â§à§è§Ö§ß§ä§í §ß§Ñ §Ó§ã§Ö§ç §å§â§à§Ó§ß§ñ§ç §Õ§Ý§ñ §Ù§Ñ§Õ§Ñ§ß§ß§à§Ô§à §á§Ö§â§Ó§à§Ô§à §Ó§Ù§ß§à§ã§Ñ

    function calcReturnPercents(uint dep) public pure returns (uint[] percents){

        percents = new uint[](MAX_LEVEL);

        for(uint i=0; i<MAX_LEVEL; ++i){

            percents[i] = calcReturnPercent(dep, i);

        }

    }



}